<?php
/**
 * @brief 中文语言包
 *
 * @author xieyong <qxieyongp@163.com>
 * @date 2019-03-15 08:36
 */

return [
    // SystemException 1000-1100
    '1001' => '没有配置{lang}语言文件',

    // DIException 1100~1120
    '1101' => '服务{name}重复定义',
    '1102' => '服务{name}未定义',
    '1103' => '服务{name}调用失败',

    // ConfigException 1120-1130
    '1121' => '配置文件路径未设置',
    '1122' => '配置文件{file_path}不存在',
    '1123' => '配置项{key}不存在',

    // ProcessException 1130-1140
    '1131' => '参数必须是索引数组',
    '1132' => '任务参数为空',
    '1133' => '捕捉到执行异常',
    '1134' => '任务不是可执行闭包',
    '1135' => '无效的进程总数',

    // KeyValServiceException 1140-1150
    '1140' => 'Key为空',
    '1141' => 'Key {k} 未设置',
    '1142' => '写redis异常',

    // AdminUserServiceException 1200-1300
    '1201' => '用户名为空',
    '1202' => '数据库错误',
    '1203' => '用户名已存在',

    // CliException 1300~1400
    '1301' => '{class}必须继承CommandBase类',
    '1302' => '{name}参数未设置',
    '1303' => '命令不存在',
    '1304' => '错误的调用{call}',

    // DBException 1400-1500
    '1401' => '数据库连接错误',
    '1402' => '同时插入的数据过多',
    '1403' => '删除操作传入参数为空',
    '1404' => '检查是否存在时传入参数为空',
    '1405' => '更新表操作未设置查询条件',
    '1406' => '数据库操作失败',
    '1407' => '未设置数据表名',

    // UserServiceException 1500-1600
    '1501' => '用户名为空',
    '1502' => '该用户名已被占用',
    '1503' => '密码为空',
    '1504' => '学号为空',
    '1505' => '该学号已被占用',
    '1506' => '无效用户id',
    '1507' => '数据库操作异常',
    '1508' => '昵称为空',

];
